## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "mpfx-prod"
        }
      + tags_all = {
          + "Contact"     = "felipejsborges@outlook.com"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform/setup"
          + "Name"        = "mpfx-prod"
          + "Project"     = "my-app"
        }
      + vpc_id   = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "mpfx-prod"
        }
      + tags_all                             = {
          + "Contact"     = "felipejsborges@outlook.com"
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform/setup"
          + "Name"        = "mpfx-prod"
          + "Project"     = "my-app"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>